# Задача №4, 17 Вариант
# Программа выводит имя, под которым скрывается Грета Густафсон и дополнительно выводит область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти)

# Оршонова Е.Г.
# 11.04.2016



печать ( " Грета Густафсон Более извесная, как шведская и американская актриса Грета Гарбо. " )
родился = 1905
смерть = 1990
возраст = 1 990 - +1905
место = " Стокгольм, Швеция "
Interes = " кино "
печать ( " место рождения: " + (место))
печать ( " год рождения: " + ул (род))
печать ( " возраст на момент смерти: " + ул (возраст))
печать ( " момент смерти: " + ул (смерть))
печать ( " область интересов: " + (Interes))
вход ( " Нажмите Enter для выхода. " )